[{"date":1607281467000,"favorites":"0","id":"1335661400081969152","isRetweet":true,"retweets":"10413","text":"RT @PATPmovie: Our new trailer! The Plot Against The President in 2mins &amp; 20!!!\nFull movie on Amazon:\n\nhttps://st.co/3RoOIuGMPZ https://t.co…"},{"date":1602994327000,"favorites":0,"id":"1317679831551594503","isRetweet":true,"retweets":13580,"text":"RT @DineshDSouza: My new film TRUMP CARD is out October 9. My best one yet! \n\nOn Apple iTunes, Google, Amazon Prime, Dish and other platfor…"},{"date":1597790951000,"favorites":102013,"id":"1295855291523723264","isRetweet":false,"retweets":24645,"text":".@Amazon, and others in that business, should be charged (by the U.S. Postal System) much more per package, and the Post Office would be immediately brought back to “good health”, now vibrant, with ALL jobs saved. No pass on to customers. Get it done!"},{"date":1595808362000,"favorites":35724,"id":"1287539708072009730","isRetweet":false,"retweets":10935,"text":"He is, and people are not happy about it. The Washington Post is a political front for Amazon. Nobody treated Ronald Reagan worse! https://t.co/Op2UnQ5uWj"},{"date":1592484291000,"favorites":63840,"id":"1273597543113424899","isRetweet":false,"retweets":13623,"text":"“BLITZ, Trump Will Smash the Left and Win”, by David Horowitz. Amazon #1 Bestseller. Call 800-691-0022  Hot book, great author!"},{"date":1591183631000,"favorites":121188,"id":"1268142181489029121","isRetweet":false,"retweets":29957,"text":"Really sick to watch the Fake and totally Slanted News(?) coming out of MSDNC and CNN. It bears NO relationship to the Truth or Facts. They are merely offshoots of the DNC, much like the @nytimes and the Amazon @washingtonpost. Just like 2016, but worse. Sad, but we will win big!"},{"date":1590536410000,"favorites":212845,"id":"1265427538140188676","isRetweet":false,"retweets":63869,"text":".@Twitter is now interfering in the 2020 Presidential Election. They are saying my statement on Mail-In Ballots, which will lead to massive corruption and fraud, is incorrect, based on fact-checking by Fake News CNN and the Amazon Washington Post...."},{"date":1586630583000,"favorites":111684,"id":"1249045314994081795","isRetweet":false,"retweets":28905,"text":"When the Failing @nytimes or Amazon @washingtonpost writes a story saying “unnamed sources said”, or any such phrase where a person’s  name is not used, don’t believe them. Most of these unnamed sources don’t exist. They are made up to defame &amp; disparage. They have no “source”..."},{"date":1585833667000,"favorites":0,"id":"1245702804611780610","isRetweet":true,"retweets":6683,"text":"RT @nickmalinowskii: A big thanks to all the workers of ups, usps, Amazon, etc. who are still going to work every day risking their health…"},{"date":1579546124000,"favorites":54575,"id":"1219330940461309952","isRetweet":false,"retweets":13564,"text":"Two stone cold losers from Amazon WP. Almost every story is a made up lie, just like corrupt pol Shifty Schiff, who fraudulently made up my call with Ukraine. Fiction! https://t.co/0Oad0738NG"},{"date":1579190359000,"favorites":39130,"id":"1217838753810669568","isRetweet":false,"retweets":12299,"text":"Amazon Calls 'Profiles in Corruption' the 'Most Anticipated' Nonfiction Book https://t.co/sOQcs3OHS4 via @BreitbartNews"},{"date":1573140477000,"favorites":75212,"id":"1192463709400117250","isRetweet":false,"retweets":20700,"text":"The Amazon Washington Post and three lowlife reporters, Matt Zapotosky, Josh Dawsey, and Carol Leonnig, wrote another Fake News story, without any sources (pure fiction), about Bill Barr &amp, myself. We both deny this story, which they knew before they wrote it. A garbage newspaper!"},{"date":1573103320000,"favorites":59693,"id":"1192307858366271490","isRetweet":false,"retweets":15302,"text":"The story in the Amazon Washington Post, of course picked up by Fake News CNN, saying “President Trump asked for AG Barr to host a news conference clearing him on Ukraine,” is totally untrue and just another FAKE NEWS story with anonymous sources that don’t exist...."},{"date":1569110685000,"favorites":69551,"id":"1175561536510812163","isRetweet":false,"retweets":16092,"text":"The LameStream Media had a very bad week. They pushed numerous phony stories and got caught, especially The Failing New York Times, which has lost more money over the last 10 years than any paper in history, and The Amazon Washington Post. They are The Enemy of the People!"},{"date":1568203978000,"favorites":57903,"id":"1171758531449643008","isRetweet":false,"retweets":10588,"text":"In a hypothetical poll, done by one of the worst pollsters of them all, the Amazon Washington Post/ABC, which predicted I would lose to Crooked Hillary by 15 points (how did that work out?), Sleepy Joe, Pocahontas and virtually all others would beat me in the General Election...."},{"date":1567426196000,"favorites":89827,"id":"1168496276918480896","isRetweet":false,"retweets":21592,"text":"The Amazon Washington Post did a story that I brought racist attacks against the “Squad.” No, they brought racist attacks against our Nation. All I do is call them out for the horrible things they have said. The Democrats have become the Party of the Squad!"},{"date":1567038100000,"favorites":50934,"id":"1166868481620492296","isRetweet":false,"retweets":11810,"text":"The  Amazon Washington Post and @CNN just did a Fake Interview on Pardons for Aids on the Wall, and that I didn’t think the Wall on the Southern Border was that important to stop Illegals wanting to come into our Country. WRONG, vitally important. Will make a BIG impact. So bad!"},{"date":1567019199000,"favorites":70694,"id":"1166789207215484928","isRetweet":false,"retweets":17212,"text":"Another totally Fake story in the Amazon Washington Post (lobbyist) which states that if my Aides broke the law to build the Wall (which is going up rapidly), I would give them a Pardon. This was made up by the Washington Post only in order to demean and disparage - FAKE NEWS!"},{"date":1566916215000,"favorites":108777,"id":"1166357258726498304","isRetweet":false,"retweets":21589,"text":"I have gotten to know President @jairbolsonaro well in our dealings with Brazil. He is working very hard on the Amazon fires and in all respects doing a great job for the people of Brazil - Not easy. He and his country have the full and complete support of the USA!"},{"date":1566597865000,"favorites":157714,"id":"1165022004392681472","isRetweet":false,"retweets":32116,"text":"Just spoke with President @JairBolsonaro of Brazil. Our future Trade prospects are very exciting and our relationship is strong, perhaps stronger than ever before. I told him if the United States can help with the Amazon Rainforest fires, we stand ready to assist!"},{"date":1566572344000,"favorites":74612,"id":"1164914962529247232","isRetweet":false,"retweets":16566,"text":"....your companies HOME and making your products in the USA. I will be responding to China’s Tariffs this afternoon. This is a GREAT opportunity for the United States. Also, I am ordering all carriers, including Fed Ex, Amazon, UPS and the Post Office, to SEARCH FOR &amp, REFUSE,...."},{"date":1565595504000,"favorites":"0","id":"1160998990390931456","isRetweet":false,"retweets":"6838","text":"RT @ArthurSchwartz: They call it “Thursday” at the Amazon Washington Post.  Washington Post 'embarrassed' over gaffe-filled story needing..."},{"date":1563798706000,"favorites":64288,"id":"1153281479184658433","isRetweet":false,"retweets":13341,"text":"The Amazon Washington Post front page story yesterday was total Fake News. They said “Advisors wrote new talking points and handed him reams of opposition research on the four Congresswomen.” Now really, does that sound like me? What advisors, there were no talking points,...."},{"date":1560692362000,"favorites":84482,"id":"1140252528304631808","isRetweet":false,"retweets":16193,"text":"A poll should be done on which is the more dishonest and deceitful newspaper, the Failing New York Times or the Amazon (lobbyist) Washington Post! They are both a disgrace to our Country, the Enemy of the People, but I just can’t seem to figure out which is worse? The good....."},{"date":1551751834000,"favorites":63892,"id":"1102753238451929088","isRetweet":false,"retweets":14708,"text":".... Amazon, like the Washington Post. It’s hard to remember that not so long ago America had prestige media outlets, but not anymore.” @TuckerCarlson   The Fake News Media is the true Enemy of the People!"},{"date":1547430310000,"favorites":91891,"id":"1084627451983073280","isRetweet":false,"retweets":18388,"text":"So sorry to hear the news about Jeff Bozo being taken down by a competitor whose reporting, I understand, is far more accurate than the reporting in his lobbyist newspaper, the Amazon Washington Post. Hopefully the paper will soon be placed in better &amp, more responsible hands!"},{"date":1547308643000,"favorites":92366,"id":"1084117143988461571","isRetweet":false,"retweets":18855,"text":"I just watched a Fake reporter from the Amazon Washington Post say the White House is “chaotic, there does not seem to be a strategy for this Shutdown. There is no plan.” The Fakes always like talking Chaos, there is NONE. In fact, there’s almost nobody in the W.H. but me, and..."},{"date":1533351706000,"favorites":51528,"id":"1025577505615503360","isRetweet":false,"retweets":11096,"text":"Congratulations to Gregg Jarrett on his book, “THE RUSSIA HOAX, THE ILLICIT SCHEME TO CLEAR HILLARY CLINTON AND FRAME DONALD TRUMP,” going to #1 on @nytimes and Amazon. It is indeed a HOAX and WITCH HUNT, illegally started by people who have already been disgraced. Great book!"},{"date":1533184695000,"favorites":60027,"id":"1024877011775500290","isRetweet":false,"retweets":13662,"text":"Congratulations to  @GreggJarrett on The TREMENDOUS success of his just out book, “The Russia Hoax, The Illicit Scheme To Clear Hillary Clinton &amp, Frame Donald Trump.” Already number one on Amazon. Hard work from a brilliant guy. It’s the Real Story of the Rigged Witch Hunt!"},{"date":1532891359000,"favorites":56344,"id":"1023646669685104641","isRetweet":false,"retweets":11489,"text":"...and the Amazon Washington Post do nothing but write bad stories even on very positive achievements - and they will never change!"},{"date":1532352920000,"favorites":69316,"id":"1021388295618682881","isRetweet":false,"retweets":14358,"text":"....In my opinion the Washington Post is nothing more than an expensive (the paper loses a fortune) lobbyist for Amazon. Is it used as protection against antitrust claims which many feel should be brought?"},{"date":1532352075000,"favorites":72136,"id":"1021384752136409088","isRetweet":false,"retweets":16036,"text":"The Amazon Washington Post has gone crazy against me ever since they lost the Internet Tax Case in the U.S. Supreme Court two months ago. Next up is the U.S. Post Office which they use, at a fraction of real cost, as their “delivery boy” for a BIG percentage of their packages...."},{"date":1530969671000,"favorites":106026,"id":"1015586529484443648","isRetweet":false,"retweets":23230,"text":"Twitter is getting rid of fake accounts at a record pace. Will that include the Failing New York Times and propaganda machine for Amazon, the Washington Post, who constantly quote anonymous sources that, in my opinion, don’t exist - They will both be out of business in 7 years!"},{"date":1522763737000,"favorites":71134,"id":"981168344924536832","isRetweet":false,"retweets":16039,"text":"I am right about Amazon costing the United States Post Office massive amounts of money for being their Delivery Boy. Amazon should pay these costs (plus) and not have them bourne by the American Taxpayer. Many billions of dollars. P.O. leaders don’t have a clue (or do they?)!"},{"date":1522676103000,"favorites":65042,"id":"980800783313702918","isRetweet":false,"retweets":14299,"text":"Only fools, or worse, are saying that our money losing Post Office makes money with Amazon. THEY LOSE A FORTUNE, and this will be changed. Also, our fully tax paying retailers are closing stores all over the country...not a level playing field!"},{"date":1522500779000,"favorites":75521,"id":"980065419632566272","isRetweet":false,"retweets":17633,"text":"...does not include the Fake Washington Post, which is used as a “lobbyist” and should so  REGISTER. If the P.O. “increased its parcel rates, Amazon’s shipping costs would rise by $2.6 Billion.” This Post Office scam must stop. Amazon must pay real costs (and taxes) now!"},{"date":1522500341000,"favorites":69373,"id":"980063581592047617","isRetweet":false,"retweets":17011,"text":"While we are on the subject, it is reported that the U.S. Post Office will lose $1.50 on average for each package it delivers for Amazon. That amounts to Billions of Dollars. The Failing N.Y. Times reports that “the size of the company’s lobbying staff has ballooned,” and that..."},{"date":1522324658000,"favorites":110494,"id":"979326715272065024","isRetweet":false,"retweets":26406,"text":"I have stated my concerns with Amazon long before the Election. Unlike others, they pay little or no taxes to state &amp, local governments, use our Postal System as their Delivery Boy (causing tremendous loss to the U.S.), and are putting many thousands of retailers out of business!"},{"date":1514552649000,"favorites":103195,"id":"946728546633953285","isRetweet":false,"retweets":22167,"text":"Why is the United States Post Office, which is losing many billions of dollars a year, while charging Amazon and others so little to deliver their packages, making Amazon richer and the Post Office dumber and poorer? Should be charging MUCH MORE!"},{"date":1502878365000,"favorites":58345,"id":"897763049226084352","isRetweet":false,"retweets":14303,"text":"Amazon is doing great damage to tax paying retailers. Towns, cities and states throughout the U.S. are being hurt - many jobs being lost!"},{"date":1500950177000,"favorites":51439,"id":"889675644396867584","isRetweet":false,"retweets":13335,"text":"Is Fake News Washington Post being used as a lobbyist weapon against Congress to keep Politicians from looking into Amazon no-tax monopoly?"},{"date":1500949724000,"favorites":45739,"id":"889673743873843200","isRetweet":false,"retweets":10311,"text":"So many stories about me in the @washingtonpost are Fake News. They are as bad as ratings challenged @CNN. Lobbyist for Amazon and taxes?"},{"date":1500949398000,"favorites":48967,"id":"889672374458646528","isRetweet":false,"retweets":11912,"text":"The Amazon Washington Post fabricated the facts on my ending massive, dangerous, and wasteful payments to Syrian rebels fighting Assad....."},{"date":1500854256000,"favorites":58888,"id":"889273320574783489","isRetweet":false,"retweets":12234,"text":"It's hard to read the Failing New York Times or the Amazon Washington Post because every story/opinion, even if should be positive, is bad!"},{"date":1500719581000,"favorites":60915,"id":"888708453560184832","isRetweet":false,"retweets":15131,"text":"A new INTELLIGENCE LEAK from the Amazon Washington Post,this time against A.G. Jeff Sessions.These illegal leaks, like Comey's, must stop!"},{"date":1498655174000,"favorites":44617,"id":"880049704620494848","isRetweet":false,"retweets":10265,"text":"The #AmazonWashingtonPost, sometimes referred to as the guardian of Amazon not paying internet taxes (which they should) is FAKE NEWS!"}]